"use client";

// Shadcn
import {
  Card,
  CardContent,
  CardDescription,
  CardHeader,
  CardTitle,
} from "@/components/ui/card";
import {
  Table,
  TableBody,
  TableCell,
  TableHead,
  TableHeader,
  TableRow,
} from "@/components/ui/table";

import { QuestionDataCounting } from "./page";

// Data
const q2Raw = `กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, แปรงลบกระดาน, กรรไกร, เทปใส, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | กรรไกร, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ | ไม้กวาด, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องใส่เอกสาร (ไว้เก็บสมุดเซ็น/เอกสารต่าง ๆ) | ชุดไม้ถูพื้น, ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, กล่องเก็บโทรศัพท์มือถือ | ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ | ชุดไม้ถูพื้น, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), กรรไกร, กบเหลาดินสอ | ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องใส่เอกสาร (ไว้เก็บสมุดเซ็น/เอกสารต่าง ๆ) | แปรงลบกระดาน | ชุดไม้ถูพื้น, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีแดง, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ชุดไม้ถูพื้น, กบเหลาดินสอ | ไม้กวาด, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีน้ำเงิน, แปรงลบกระดาน, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ | ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, แปรงลบกระดาน, กบเหลาดินสอ, กล่องเก็บโทรศัพท์มือถือ | ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง | ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, แปรงลบกระดาน, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ | ชุดไม้ถูพื้น, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, แปรงลบกระดาน, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ | เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กล่องเก็บโทรศัพท์มือถือ, กล่องใส่เอกสาร (ไว้เก็บสมุดเซ็น/เอกสารต่าง ๆ) | ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, แปรงลบกระดาน, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ, กล่องใส่เอกสาร (ไว้เก็บสมุดเซ็น/เอกสารต่าง ๆ) | ไม้กวาด, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ, กล่องใส่เอกสาร (ไว้เก็บสมุดเซ็น/เอกสารต่าง ๆ) | ไม้กวาด, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีน้ำเงิน, แปรงลบกระดาน, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ชุดไม้ถูพื้น, กล่องเก็บโทรศัพท์มือถือ | ชุดไม้ถูพื้น, ปากกาไวท์บอร์ดสีน้ำเงิน, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กล่องเก็บโทรศัพท์มือถือ | ไม้กวาด, ชุดไม้ถูพื้น, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีน้ำเงิน, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ไม้กวาด, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ | ไม้กวาด, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, แปรงลบกระดาน, กบเหลาดินสอ | ไม้กวาด, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ไม้กวาด, ชุดไม้ถูพื้น, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง, แปรงลบกระดาน, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ | ไม้กวาด, ปากกาไวท์บอร์ดสีดำ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ) | ไม้กวาด, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีน้ำเงิน, ปากกาไวท์บอร์ดสีแดง | ชุดไม้ถูพื้น | ชุดไม้ถูพื้น | กล่องเก็บโทรศัพท์มือถือ | ไม้กวาด, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีดำ, ปากกาไวท์บอร์ดสีแดง, กรรไกร, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ | เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ | ชุดไม้ถูพื้น, ผ้าเช็ดโต๊ะ (เอาไว้ใช้ชุบน้ำและทำความสะอาดกระดาน/โต๊ะ), ปากกาไวท์บอร์ดสีน้ำเงิน, แปรงลบกระดาน, เทปใส, เครื่องเย็บกระดาษ และลวดเย็บกระดาษ, กบเหลาดินสอ, กล่องใส่เครื่องเขียน (ไว้ใส่อุปกรณ์การเรียนที่ตกพื้นแล้วไม่มีเจ้าของ), กล่องเก็บโทรศัพท์มือถือ`;
const q2: QuestionDataCounting = {};
q2Raw.split(" | ").forEach((personData) => {
  personData.split(", ").forEach((data) => {
    q2[data] = (q2[data] || 0) + 1;
  });
});

const q2ChartData = Object.entries(q2)
  .sort((a, b) => b[1] - a[1])
  .slice(0, 10)
  .map((pair) => ({ name: pair[0], amount: pair[1] }));

export function Question2() {
  return (
    <Card>
      <CardHeader>
        <CardTitle>สิ่งของที่ต้องการเพิ่มในห้องเรียน (Top 10)</CardTitle>
        <CardDescription>คัดเลือกจากอันดับที่มีผู้เลือกมากที่สุด 10 ลำดับ</CardDescription>
      </CardHeader>
      <CardContent>
        {/* Sumary */}
        <Table>
          <TableHeader>
            <TableRow>
              <TableHead className="w-10">อันดับ</TableHead>
              <TableHead>รายการของใช้</TableHead>
              <TableHead className="w-20">จำนวนคนเลือก</TableHead>
            </TableRow>
          </TableHeader>
          <TableBody>
            {q2ChartData.map((pair, index) => {
              return (
                <TableRow key={index}>
                  <TableCell>{index + 1}</TableCell>
                  <TableCell>{pair.name}</TableCell>
                  <TableCell>{pair.amount} เสียง</TableCell>
                </TableRow>
              );
            })}
          </TableBody>
        </Table>
      </CardContent>
    </Card>
  );
}
